*** 计算原理(python)
    - rt1为时间序列, rt0为其向前平移l期的历史数据, l期的自相关系数就是rt1和rt0的相关性
    - 注意: 计算方法和标准计算方法存在一定误差, 主要在于说明原理
    #+BEGIN_SRC python :exports both
    from random import gauss
    from pandas import Series
    rt = Series(map(lambda x: gauss(0, 1), range(1000)))
    l = 1
    rt1 = rt[l:].reset_index(drop=True)
    rt0 = rt[:-l].reset_index(drop=True)
    return rt1.corr(rt0)
    #+END_SRC

    #+RESULTS:
    : -0.071987843338
**** IBM简单收益率
     Q5: 3.37, p-value: 0.64, 结论: 没有序列相关性
     #+BEGIN_SRC python :exports both
     import pandas as pd
     from statsmodels.stats.diagnostic import acorr_ljungbox
     df = pd.read_table('data/m-ibm3dx2608.txt', delim_whitespace=True)
     ret = df['ibmrtn']
     return acorr_ljungbox(ret, lags=5)
     #+END_SRC

     #+RESULTS:
     | array | ((1.59186057 1.63285984 1.95680258 2.935275 3.36822158)) | array | ((0.20706051 0.44200684 0.58142072 0.56871475 0.64341427)) |
**** IBM对数收益率
     Q5: 3.52, p-value: 0.62, 结论: 没有序列相关性
     #+BEGIN_SRC python :exports both
     import math
     import pandas as pd
     from statsmodels.stats.diagnostic import acorr_ljungbox
     df = pd.read_table('data/m-ibm3dx2608.txt', delim_whitespace=True)
     ret = df['ibmrtn']
     lret = (ret + 1).apply(math.log)
     return acorr_ljungbox(lret, lags=5)
     #+END_SRC

     #+RESULTS:
     | array | ((1.96700707 1.96751272 2.16162956 2.95889339 3.52357851)) | array | ((0.1607659 0.37390394 0.53954564 0.56472789 0.61982294)) |

**** CRSP简单收益率
     Q5: 29.71, p-value: 1.68e-5, 结论: 有序列相关性
     #+BEGIN_SRC python :exports both
     import pandas as pd
     from statsmodels.stats.diagnostic import acorr_ljungbox
     df = pd.read_table('data/m-ibm3dx2608.txt', delim_whitespace=True)
     ret = df['vwrtn']
     return acorr_ljungbox(ret, lags=5)
     #+END_SRC

     #+RESULTS:
     | array | ((13.30296086 13.57991139 24.92941759 24.99213515 29.71071903)) | array | ((0.000264987326 0.00112501862 1.59741684e-05 5.04933343e-05 1.68136612e-05)) |

**** CRSP对数收益率 
     Q5: 28.38, p-vlaue: 3.07e-5, 结论: 有序列相关性
     #+BEGIN_SRC python :exports both
     import math
     import pandas as pd
     from statsmodels.stats.diagnostic import acorr_ljungbox
     df = pd.read_table('data/m-ibm3dx2608.txt', delim_whitespace=True)
     ret = df['vwrtn']
     lret = (ret + 1).apply(math.log)
     return acorr_ljungbox(lret, lags=5)
     #+END_SRC

     #+RESULTS:
     | array | ((12.10621836 12.23689637 21.49225015 21.70925299 28.37861003)) | array | ((0.0005025395 0.00220187021 8.31865512e-05 0.000228972584 3.06919959e-05)) |

****** 求解差分方程
       - 解方程得到: x1 = -1.92, x2 = 1.60 - 1.06i, x3 = 1.60 + 1.06i
       - 其中x2和x3共轭
       #+BEGIN_SRC python :results output :exports both
       from sympy import *
       x = symbols('x')
       equation = Eq(1 - 0.3480 * x -  0.1793 * x ** 2 - (-0.1413) * x ** 3 , 0)
       print solveset(equation)     
       #+END_SRC

       #+RESULTS:
       : {-1.9237144183584, 1.59632288504615 - 1.06331883116012*I, 1.59632288504615 + 1.06331883116012*I}
     
****** 求解经济周期
       - 
       #+BEGIN_SRC python :results output :exports both
       from math import acos
       # 2 * 3.14159 / acos(b1/(2*(-b2 ** .5)))
       print 2 * 3.14159 / acos(0.869/(2*(0.274 ** .5))) 
       #+END_SRC 

       #+RESULTS:
       : 10.6213043471

